Revit 2024 API
OverrideGraphicSettings.CutForegroundPatternColor Property
 The override color of the foreground pattern of cut faces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public Color CutForegroundPatternColor { get; }
Visual Basic
Public ReadOnly Property CutForegroundPatternColor As Color
	Get
Visual C++
public:
property Color^ CutForegroundPatternColor {
	Color^ get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace